<template>
    <div class="d-flex align-center">
        <v-container>
            <h2>Описание</h2>
            <p>Программист Гриша с детства мечтал побывать на Мадагаскаре, но почему-то регулярных рейсов туда нет. Поэтому Гриша все лето изучал Мадагаскар с помощью книг. Теперь он знает, что на Мадагаскаре водится несколько видов лемуров:</p>
            <ul>
                <li>Карликовые лемуры — любители петь;</li>
                <li>Руконожковые — любители потанцевать;</li>
                <li>Индриевые — любители сёрфинга.</li>
            </ul>
            <p>К сожалению, в книгах не было сказано, какой вид лемуров самый многочисленный. Гриша решил выяснить это: он прочитал эти книги еще раз, и каждый раз, когда видел лемура, записывал на лист бумаги название его вида. Сейчас Гриша дал вам листок с просьбой выяснить, какой вид лемуров самый многочисленный.</p>
            <h2>Исходные данные</h2>
            <p>В первой строке записано целое число n — количество записей на листе (1 ≤ n ≤ 1000). В каждой из следующих n строк записано по одному виду лемуров. Среди видов встречаются только «Карликовый», «Руконожковый» и «Индриевый».</p>
            <h2>Результат</h2>
            <p>Выведите самый популярный вид лемуров. Гарантируется, что такой вид только один.</p>
            <h3>Пример</h3>
            <table>
                <tr>
                    <th>исходные данные</th>
                    <th>результат</th>
                </tr>
                <tr>
                    <td>7</td>
                    <td>Индриевый</td>
                </tr>
                <tr>
                    <td>Карликовый</td>
                    <td></td>
                </tr>
                <tr>
                    <td>Индриевый</td>
                    <td></td>
                </tr>
                <tr>
                    <td>Руконожковый</td>
                    <td></td>
                </tr>
                <tr>
                    <td>Карликовый</td>
                    <td></td>
                </tr>
                <tr>
                    <td>Индриевый</td>
                    <td></td>
                </tr>
                <tr>
                    <td>Индриевый</td>
                    <td></td>
                </tr>
                <tr>
                    <td>Руконожковый</td>
                    <td></td>
                </tr>
            </table>
        </v-container>

        <Presentation/>
    </div>
</template>

<script>
  export default {
    name: "Lemurs"
  }
</script>

<style scoped>

</style>